tap "farion1231/ccswitch"
tap "nikitabobko/tap"
brew "bat"
brew "bottom"
brew "broot"
brew "dotter"
brew "dust"
brew "eza"
brew "fastfetch"
brew "fd"
brew "git"
brew "helix"
brew "hyperfine"
brew "lazydocker"
brew "lazygit"
brew "llvm"
brew "lsd"
brew "mcfly"
brew "mise"
brew "mole"
brew "ncdu"
brew "procs"
brew "rcm"
brew "ripgrep"
brew "rm-improved"
brew "sd"
brew "taplo"
brew "tealdeer"
brew "termscp"
brew "tig"
brew "tmux"
brew "zimfw"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-f-sy-h"
brew "zsh-history-substring-search"
cask "nikitabobko/tap/aerospace"
cask "alacritty"
cask "farion1231/ccswitch/cc-switch"
cask "claude-code"
cask "font-jetbrains-mono"
cask "font-roboto-mono"
cask "input-source-pro"
cask "karabiner-elements"
cask "logseq"
cask "openinterminal"
cask "openinterminal-lite"
cask "orbstack"
cask "raycast"
cask "showyedge"
cask "squirrel-app"
cask "visual-studio-code"
vscode "alefragnani.project-manager"
vscode "arcanis.vscode-zipfs"
vscode "chaitanyashahare.lazygit"
vscode "dsznajder.es7-react-js-snippets"
vscode "fill-labs.dependi"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "hdevalke.rust-test-lens"
vscode "hverlin.mise-vscode"
vscode "laurencebahiirwa.deno-std-lib-snippets"
vscode "ms-azuretools.vscode-containers"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "quandinh.onehalf-dark"
vscode "redhat.java"
vscode "shubhsharma.lazyvim-theme"
vscode "skacekachna.win-opacity"
vscode "tamasfe.even-better-toml"
vscode "vadimcn.vscode-lldb"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
cargo "tauri-cli"
